app/Views/kategori/cadangan.php

    <?php

    $id_buku = $_GET['id_buku'];
    $sql =  $db->table('hlmnbuku')->where('id_buku', $id_buku)->get();
---
SELECT *
FROM `hlmnbuku`
WHERE `id_buku` = 'bk02'