app/Controllers/CategoryController.php

    public function index()
    {
        if ($this->session->get('role') == 2 || $this->session->get('role') == NULL) {


            $data = [
                'title' => 'Category',
                'db' => $this->db,
                'category' => $this->db->table('hlmnbuku')->get()->getResultArray(),
---
SELECT *
FROM `hlmnbuku`